clear all
G = 1;
m1=1; 
m2=1; 
m3=1; 
 
r10 = [-0.97000436, 0.24308753]; 
r20 = [0,0]; 
r30 = [0.97000436, -0.24308753];
 
v10 = [0.4662036850, 0.4323657300]; 
v20 = [-0.93240737, -0.86473146];
v30 = [0.4662036850, 0.4323657300];%“8”字形解的初值

Y0=[r10,v10,r20,v20,r30,v30]; %初值

fun = @(t, Y) [Y(3:4); -G*m2*(Y(1:2)-Y(5:6))/norm( Y(1:2)-Y(5:6))^3-G*m3*(Y(1:2)-Y(9:10))/norm( Y(1:2)-Y(9:10))^3;
    Y(7:8); -G*m1*(Y(5:6)-Y(1:2))/norm( Y(5:6)-Y(1:2))^3-G*m3*(Y(5:6)-Y(9:10))/norm( Y(5:6)-Y(9:10))^3;
    Y(11:12); -G*m1*(Y(9:10)-Y(1:2))/norm( Y(9:10)-Y(1:2))^3-G*m2*(Y(9:10)-Y(5:6))/norm( Y(9:10)-Y(5:6))^3];

options = odeset('RelTol',1e-8,'AbsTol',1e-10);%绝对误差和相对误差

[t, Y] = ode15s(fun, [0 20], Y0,options); %刚性方程，所以用ode15s求解
%ode15s（函数，积分时长，初值，精度）

hold on;
plot(Y(1, 1), Y(1, 2), 'ro');
plot(Y(1, 5), Y(1, 6), 'ko');
plot(Y(1, 9), Y(1, 10), 'bo');%三个初始位置

plot(Y(:, 1), Y(:, 2), 'r-', 'DisplayName', 'm_1');
plot(Y(:, 5), Y(:, 6),  'g-', 'DisplayName', 'm_2');
plot(Y(:, 9), Y(:, 10),  '-','color',[0,1,1], 'DisplayName', 'm_3');%三个动起来后的轨迹
xlabel('X');
ylabel('Y');
%legend('show');


axis equal;
grid on;
