clear all

syms x15  x16  x18  x25  x26  x28  x35  x36  x38  x45  x46  x48  x55  x56  x58 %定义变量

% 定义矩阵x
x= [x15; x16; x18; x25; x26;x28; x35; x36; x38; x45; x46; x48; x55; x56; x58];

% 目标函数 D
fun = @(x) 220.85 * (0.6 .^ x(1,1)) .* (0.55 .^ x(2,1)) .* (0.4 .^ x(3,1)) * 0.8 + ... % D1
         + 610.75 * (0.4 .^ x(4,1)) .* (0.35 .^ x(5,1)) .* (0.4 .^ x(6,1)) * 0.7 + ... % D2
         + 220.90 * (0.6 .^ x(7,1)) .* (0.55 .^ x(8,1)) .* (0.6 .^ x(9,1)) * 0.7 + ... % D3
         + 410.75 * (0.4 .^ x(10,1)) .* (0.35 .^ x(11,1)) .* (0.4 .^ x(12,1)) * 0.7 + ... % D4
         + 410.85 * (0.4 .^ x(13,1)) .* (0.35 .^ x(14,1)) .* (0.4 .^ x(15,1)) * 0.8;   % D5

% 非等式约束条件
A = [1,0,0,1,0,0,1,0,0,1,0,0,1,0,0;
     0,1,0,0,1,0,0,1,0,0,1,0,0,1,0;
     0,0,1,0,0,1,0,0,1,0,0,1,0,0,1;];%系数矩阵
b = [32;10;40];

% 等式约束条件，这里没有
Aeq = [];
beq = [];

lb = [0;0;0;0;0;0;0;0;0;0;0;0;0;0;0];   % 各变量的下界，都是0
ub = [];            % 上界我不知道
x0=[0;1;0;0;0;0;0;0;0;0;0;0;0;0;0];%猜想初始值

% 使用fmincon函数寻找最小值
[xmin, fmin] = fmincon(fun, x0, A, b, Aeq, beq, lb, ub);

% 因为题目要求X是非负整数，需要检查并调整结果
xOptimal = floor(xmin);  % 取整数部分
if any(xOptimal < 0)
    error('解不是非负整数');
end

% 输出结果
fprintf('最小值Dmin=%f\n', fmin);
disp('取最小值时各个x的值：')
disp(xOptimal'); %将各个x值输出为一行，方便查看
